Tekla.Structures.CatalogInternal.DelegateProxy
CDelegate remote class proxy.

Tekla.Structures.CatalogInternal.DelegateProxy.#cctor
Initializes static instance variable.

Tekla.Structures.CatalogInternal.DelegateProxy.Delegate
Gets the singleton CDelegate instance that includes model API methods.

Tekla.Structures.CatalogInternal.DelegateProxy.DeactivateInterface(System.String)
Deactivate Tekla.Structures.Model interface
Param:
Returns: